7767517
112 122
Input                    0                        0 1 0 0=224 1=224 2=3
Convolution              619                      1 1 0 619 0=32 1=3 3=2 4=1 5=1 6=864 8=2
ReLU                     621                      1 1 619 621
ConvolutionDepthWise     622                      1 1 621 622 0=32 1=3 4=1 5=1 6=288 7=32 8=1
ReLU                     624                      1 1 622 624
Convolution              625                      1 1 624 625 0=16 1=1 5=1 6=512 8=2
Convolution              627                      1 1 625 627 0=96 1=1 5=1 6=1536 8=2
ReLU                     629                      1 1 627 629
ConvolutionDepthWise     630                      1 1 629 630 0=96 1=3 3=2 4=1 5=1 6=864 7=96 8=1
ReLU                     632                      1 1 630 632
Convolution              633                      1 1 632 633 0=24 1=1 5=1 6=2304 8=2
Split                    splitncnn_0              1 2 633 633_splitncnn_0 633_splitncnn_1
Convolution              635                      1 1 633_splitncnn_1 635 0=144 1=1 5=1 6=3456 8=2
ReLU                     637                      1 1 635 637
ConvolutionDepthWise     638                      1 1 637 638 0=144 1=3 4=1 5=1 6=1296 7=144 8=1
ReLU                     640                      1 1 638 640
Convolution              641                      1 1 640 641 0=24 1=1 5=1 6=3456 8=2
BinaryOp                 643                      2 1 633_splitncnn_0 641 643
Convolution              644                      1 1 643 644 0=144 1=1 5=1 6=3456 8=2
ReLU                     646                      1 1 644 646
ConvolutionDepthWise     647                      1 1 646 647 0=144 1=3 3=2 4=1 5=1 6=1296 7=144 8=1
ReLU                     649                      1 1 647 649
Convolution              650                      1 1 649 650 0=32 1=1 5=1 6=4608 8=2
Split                    splitncnn_1              1 2 650 650_splitncnn_0 650_splitncnn_1
Convolution              652                      1 1 650_splitncnn_1 652 0=192 1=1 5=1 6=6144 8=2
ReLU                     654                      1 1 652 654
ConvolutionDepthWise     655                      1 1 654 655 0=192 1=3 4=1 5=1 6=1728 7=192 8=1
ReLU                     657                      1 1 655 657
Convolution              658                      1 1 657 658 0=32 1=1 5=1 6=6144 8=2
BinaryOp                 660                      2 1 650_splitncnn_0 658 660
Split                    splitncnn_2              1 2 660 660_splitncnn_0 660_splitncnn_1
Convolution              661                      1 1 660_splitncnn_1 661 0=192 1=1 5=1 6=6144 8=2
ReLU                     663                      1 1 661 663
ConvolutionDepthWise     664                      1 1 663 664 0=192 1=3 4=1 5=1 6=1728 7=192 8=1
ReLU                     666                      1 1 664 666
Convolution              667                      1 1 666 667 0=32 1=1 5=1 6=6144 8=2
BinaryOp                 669                      2 1 660_splitncnn_0 667 669
Convolution              670                      1 1 669 670 0=192 1=1 5=1 6=6144 8=2
ReLU                     672                      1 1 670 672
ConvolutionDepthWise     673                      1 1 672 673 0=192 1=3 3=2 4=1 5=1 6=1728 7=192 8=1
ReLU                     675                      1 1 673 675
Convolution              676                      1 1 675 676 0=64 1=1 5=1 6=12288 8=2
Split                    splitncnn_3              1 2 676 676_splitncnn_0 676_splitncnn_1
Convolution              678                      1 1 676_splitncnn_1 678 0=384 1=1 5=1 6=24576 8=2
ReLU                     680                      1 1 678 680
ConvolutionDepthWise     681                      1 1 680 681 0=384 1=3 4=1 5=1 6=3456 7=384 8=1
ReLU                     683                      1 1 681 683
Convolution              684                      1 1 683 684 0=64 1=1 5=1 6=24576 8=2
BinaryOp                 686                      2 1 676_splitncnn_0 684 686
Split                    splitncnn_4              1 2 686 686_splitncnn_0 686_splitncnn_1
Convolution              687                      1 1 686_splitncnn_1 687 0=384 1=1 5=1 6=24576 8=2
ReLU                     689                      1 1 687 689
ConvolutionDepthWise     690                      1 1 689 690 0=384 1=3 4=1 5=1 6=3456 7=384 8=1
ReLU                     692                      1 1 690 692
Convolution              693                      1 1 692 693 0=64 1=1 5=1 6=24576 8=2
BinaryOp                 695                      2 1 686_splitncnn_0 693 695
Split                    splitncnn_5              1 2 695 695_splitncnn_0 695_splitncnn_1
Convolution              696                      1 1 695_splitncnn_1 696 0=384 1=1 5=1 6=24576 8=2
ReLU                     698                      1 1 696 698
ConvolutionDepthWise     699                      1 1 698 699 0=384 1=3 4=1 5=1 6=3456 7=384 8=1
ReLU                     701                      1 1 699 701
Convolution              702                      1 1 701 702 0=64 1=1 5=1 6=24576 8=2
BinaryOp                 704                      2 1 695_splitncnn_0 702 704
Convolution              705                      1 1 704 705 0=384 1=1 5=1 6=24576 8=2
ReLU                     707                      1 1 705 707
ConvolutionDepthWise     708                      1 1 707 708 0=384 1=3 4=1 5=1 6=3456 7=384 8=1
ReLU                     710                      1 1 708 710
Convolution              711                      1 1 710 711 0=96 1=1 5=1 6=36864 8=2
Split                    splitncnn_6              1 2 711 711_splitncnn_0 711_splitncnn_1
Convolution              713                      1 1 711_splitncnn_1 713 0=576 1=1 5=1 6=55296 8=2
ReLU                     715                      1 1 713 715
ConvolutionDepthWise     716                      1 1 715 716 0=576 1=3 4=1 5=1 6=5184 7=576 8=1
ReLU                     718                      1 1 716 718
Convolution              719                      1 1 718 719 0=96 1=1 5=1 6=55296 8=2
BinaryOp                 721                      2 1 711_splitncnn_0 719 721
Split                    splitncnn_7              1 2 721 721_splitncnn_0 721_splitncnn_1
Convolution              722                      1 1 721_splitncnn_1 722 0=576 1=1 5=1 6=55296 8=2
ReLU                     724                      1 1 722 724
ConvolutionDepthWise     725                      1 1 724 725 0=576 1=3 4=1 5=1 6=5184 7=576 8=1
ReLU                     727                      1 1 725 727
Convolution              728                      1 1 727 728 0=96 1=1 5=1 6=55296 8=2
BinaryOp                 730                      2 1 721_splitncnn_0 728 730
Convolution              731                      1 1 730 731 0=576 1=1 5=1 6=55296 8=2
ReLU                     733                      1 1 731 733
ConvolutionDepthWise     734                      1 1 733 734 0=576 1=3 3=2 4=1 5=1 6=5184 7=576 8=1
ReLU                     736                      1 1 734 736
Convolution              737                      1 1 736 737 0=160 1=1 5=1 6=92160 8=2
Split                    splitncnn_8              1 2 737 737_splitncnn_0 737_splitncnn_1
Convolution              739                      1 1 737_splitncnn_1 739 0=960 1=1 5=1 6=153600 8=2
ReLU                     741                      1 1 739 741
ConvolutionDepthWise     742                      1 1 741 742 0=960 1=3 4=1 5=1 6=8640 7=960 8=1
ReLU                     744                      1 1 742 744
Convolution              745                      1 1 744 745 0=160 1=1 5=1 6=153600 8=2
BinaryOp                 747                      2 1 737_splitncnn_0 745 747
Split                    splitncnn_9              1 2 747 747_splitncnn_0 747_splitncnn_1
Convolution              748                      1 1 747_splitncnn_1 748 0=960 1=1 5=1 6=153600 8=2
ReLU                     750                      1 1 748 750
ConvolutionDepthWise     751                      1 1 750 751 0=960 1=3 4=1 5=1 6=8640 7=960 8=1
ReLU                     753                      1 1 751 753
Convolution              754                      1 1 753 754 0=160 1=1 5=1 6=153600 8=2
BinaryOp                 756                      2 1 747_splitncnn_0 754 756
Convolution              757                      1 1 756 757 0=960 1=1 5=1 6=153600 8=2
ReLU                     759                      1 1 757 759
ConvolutionDepthWise     760                      1 1 759 760 0=960 1=3 4=1 5=1 6=8640 7=960 8=1
ReLU                     762                      1 1 760 762
Convolution              763                      1 1 762 763 0=320 1=1 5=1 6=307200 8=2
Convolution              765                      1 1 763 765 0=1280 1=1 5=1 6=409600 8=2
ReLU                     767                      1 1 765 767
Reshape                  779                      1 1 767 779 0=-1 1=1280
Reduction                780                      1 1 779 780 0=3 1=0 -23303=1,-1
InnerProduct             781                      1 1 780 781 0=1000 1=1 2=1280000 8=2
Softmax                  782                      1 1 781 782
